HomeWork103forEDT/src/InformationRegisters/Цены/Цены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Цены</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HomeWork103forEDT/src/InformationRegisters/Скидки/Скидки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Скидки</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

HomeWork103forEDT/src/CommonModules/ЦеныСервер/Module.bsl
Функция ЦенаНаДату(Номенклатура, Дата)Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЦеныСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(&Дата, Номенклатура = &Номенклатура) КАК ЦеныСрезПоследних";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Результат.Пустой() Тогда
		Цена = 0;
	Иначе
		Пока Выборка.Следующий() Цикл
			Цена = Выборка.Цена;	
		КонецЦикла;
	КонецЕсли;
	
	Возврат Цена;
	
КонецФункции

Функция СкидкаНаДату(НоменклатураНоменклатурнаяГруппа, Дата) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиСрезПоследних.Скидка КАК Скидка
	|ИЗ
	|	РегистрСведений.Скидки.СрезПоследних(&Период, НоменклатураНоменклатурнаяГруппа = &Номенклатура) КАК СкидкиСрезПоследних";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Номенклатура",НоменклатураНоменклатурнаяГруппа); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Скидка = 0;
	
	Если Выборка.Следующий() Тогда
		Скидка = Выборка.Скидка;
	ИначеЕсли ТипЗнч(НоменклатураНоменклатурнаяГруппа) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос.УстановитьПараметр("Номенклатура", НоменклатураНоменклатурнаяГруппа.НоменклатурнаяГруппа);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Скидка = Выборка.Скидка;
		КонецЕсли;
	КонецЕсли;	
	Возврат Скидка;
	
КонецФункции
